app/views/users/show.html.erb

<h4>View or Update your own guides</h4>
  <% if @user.guides.empty?  %>
---
SELECT  1 AS one FROM "guides" WHERE "guides"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "guides".* FROM "guides" WHERE "guides"."user_id" = ?  [["user_id", 1]]