app/views/games/show.html.erb

SELECT  1 AS one FROM "guides" WHERE "guides"."game_id" = ? LIMIT ?  [["game_id", 1], ["LIMIT", 1]]
SELECT "guides".* FROM "guides" WHERE "guides"."game_id" = ?  [["game_id", 1]]
---
 <ul>
    <% if @game.guides.empty? %>