app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE (title LIKE '%blurp%')
---
  def index
    @games = Game.search(params[:search])

INSERT INTO "games" ("title", "game_system", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "God of War"], ["game_system", "PS4"], ["created_at", "2018-04-25 21:14:39.547784"], ["updated_at", "2018-04-25 21:14:39.547784"]]
---
  def create
    @game = Game.new(game_params)
    if @game.valid?
      @game.save