app/controllers/guides_controller.rb

SELECT "guides".* FROM "guides"
---
  def index
    @guides = Guide.all

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @game = which_game?
    @guide = Guide.find(params[:id])

INSERT INTO "guides" ("title", "user_id", "game_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Let me AXE you a question"], ["user_id", 1], ["game_id", 1], ["body", "sizle"], ["created_at", "2018-04-25 22:18:16.330442"], ["updated_at", "2018-04-25 22:18:16.330442"]]
---
  def create
    @game = which_game?
    @guide = Guide.new(guide_params)
    if @guide.valid?
      @guide.save

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @game = which_game?
    @guide = Guide.find(params[:id])

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "guides" SET "body" = ?, "updated_at" = ? WHERE "guides"."id" = ?  [["body", "DOINK"], ["updated_at", "2018-05-05 17:10:57.743101"], ["id", 3]]
---
  def update
    @game = which_game?
    @guide = Guide.find(params[:id])
    @guide.update(guide_params)

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "guides" WHERE "guides"."id" = ?  [["id", 2]]
---
   def destroy
     @guide = Guide.find(params[:id])
     @game = which_game?
     @guide.destroy