app/controllers/sessions_controller.rb

  def create
    if auth && !User.find_by(email: auth['info']['email'])#should this be in user controller?
      @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "users" ("user_name", "password_digest") VALUES (?, ?)  [["user_name", "Dalynn4"], ["password_digest", "$2a$10$cuALwWhswSCxKOCFYo8LPuQP.WVJm00yLfzKeiGeIiu1LvgFe.VYu"]]