app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("user_name", "password_digest") VALUES (?, ?)  [["user_name", "randall"], ["password_digest", "$2a$10$ujMPp55oQ7umWhcWOxXPzOlDZNw5q7Epe1GUv4536gasI8byN3vRm"]]

  def show
    if session[:user_id] && session[:user_id] == params[:id].to_i
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]